Evaluations/adaptivePerf_TPDS_revision/NetMARKS/data/2025_Feb_10_1200_workload1_wrk_result1.txt
Running 40m test @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 264.042ms, rate sampling interval: 771ms
  Thread calibration: mean lat.: 249.505ms, rate sampling interval: 675ms
  Thread calibration: mean lat.: 256.073ms, rate sampling interval: 514ms
  Thread calibration: mean lat.: 275.957ms, rate sampling interval: 746ms
  Thread calibration: mean lat.: 229.892ms, rate sampling interval: 510ms
  Thread calibration: mean lat.: 268.208ms, rate sampling interval: 581ms
  Thread calibration: mean lat.: 277.259ms, rate sampling interval: 947ms
  Thread calibration: mean lat.: 298.272ms, rate sampling interval: 818ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network2.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   269.83ms   40.45ms 475.14ms   90.61%
    Req/Sec     1.56      1.56     7.00     93.23%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  256.13ms
 75.000%  258.56ms
 90.000%  307.71ms
 99.000%  475.14ms
 99.900%  572.93ms
 99.990%  687.10ms
 99.999%  797.18ms
100.000%  797.18ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     251.391     0.000000            1         1.00
     253.951     0.100000         3998         1.11
     254.591     0.200000         8144         1.25
     255.103     0.300000        12111         1.43
     255.615     0.400000        16003         1.67
     256.127     0.500000        19589         2.00
     256.383     0.550000        21202         2.22
     256.767     0.600000        23282         2.50
     257.151     0.650000        24984         2.86
     257.663     0.700000        26753         3.33
     258.559     0.750000        28633         4.00
     259.327     0.775000        29464         4.44
     261.375     0.800000        30430         5.00
     269.823     0.825000        31357         5.71
     283.903     0.850000        32311         6.67
     296.959     0.875000        33272         8.00
     302.847     0.887500        33735         8.89
     307.711     0.900000        34228        10.00
     314.111     0.912500        34684        11.43
     319.231     0.925000        35169        13.33
     327.679     0.937500        35645        16.00
     331.519     0.943750        35867        17.78
     340.735     0.950000        36106        20.00
     352.255     0.956250        36344        22.86
     365.567     0.962500        36587        26.67
     379.647     0.968750        36818        32.00
     389.631     0.971875        36937        35.56
     402.175     0.975000        37055        40.00
     418.303     0.978125        37173        45.71
     432.127     0.981250        37296        53.33
     446.463     0.984375        37413        64.00
     454.143     0.985938        37471        71.11
     462.335     0.987500        37529        80.00
     470.271     0.989062        37589        91.43
     478.463     0.990625        37648       106.67
     485.375     0.992188        37708       128.00
     489.215     0.992969        37740       142.22
     492.287     0.993750        37773       160.00
     495.103     0.994531        37798       182.86
     499.967     0.995313        37828       213.33
     503.551     0.996094        37856       256.00
     506.879     0.996484        37871       284.44
     510.207     0.996875        37888       320.00
     518.911     0.997266        37901       365.71
     525.823     0.997656        37915       426.67
     534.015     0.998047        37930       512.00
     546.303     0.998242        37938       568.89
     550.911     0.998437        37945       640.00
     558.591     0.998633        37953       731.43
     565.759     0.998828        37960       853.33
     574.463     0.999023        37967      1024.00
     579.071     0.999121        37971      1137.78
     591.359     0.999219        37975      1280.00
     596.991     0.999316        37979      1462.86
     610.303     0.999414        37982      1706.67
     637.951     0.999512        37986      2048.00
     649.727     0.999561        37988      2275.56
     658.431     0.999609        37990      2560.00
     665.599     0.999658        37992      2925.71
     666.111     0.999707        37993      3413.33
     673.791     0.999756        37995      4096.00
     676.863     0.999780        37997      4551.11
     676.863     0.999805        37997      5120.00
     683.007     0.999829        37998      5851.43
     685.055     0.999854        37999      6826.67
     687.103     0.999878        38000      8192.00
     687.103     0.999890        38000      9102.22
     697.855     0.999902        38001     10240.00
     697.855     0.999915        38001     11702.86
     730.111     0.999927        38002     13653.33
     730.111     0.999939        38002     16384.00
     730.111     0.999945        38002     18204.44
     785.919     0.999951        38003     20480.00
     785.919     0.999957        38003     23405.71
     785.919     0.999963        38003     27306.67
     785.919     0.999969        38003     32768.00
     785.919     0.999973        38003     36408.89
     797.183     0.999976        38004     40960.00
     797.183     1.000000        38004          inf
#[Mean    =      269.829, StdDeviation   =       40.453]
#[Max     =      796.672, Total count    =        38004]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  38175 requests in 40.01m, 10.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 82603
Requests/sec:     15.90  
Transfer/sec:      4.67KB
Running 40m test @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 342.036ms, rate sampling interval: 1323ms
  Thread calibration: mean lat.: 337.819ms, rate sampling interval: 1060ms
  Thread calibration: mean lat.: 339.328ms, rate sampling interval: 814ms
  Thread calibration: mean lat.: 343.905ms, rate sampling interval: 795ms
  Thread calibration: mean lat.: 334.267ms, rate sampling interval: 900ms
  Thread calibration: mean lat.: 320.188ms, rate sampling interval: 898ms
  Thread calibration: mean lat.: 352.884ms, rate sampling interval: 812ms
  Thread calibration: mean lat.: 305.980ms, rate sampling interval: 848ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   287.22ms   40.10ms 509.44ms   93.37%
    Req/Sec     1.64      1.35     6.00     91.93%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  275.20ms
 75.000%  277.50ms
 90.000%  312.32ms
 99.000%  509.44ms
 99.900%  602.11ms
 99.990%  742.40ms
 99.999%  829.95ms
100.000%  829.95ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     269.823     0.000000            1         1.00
     272.895     0.100000         3933         1.11
     273.663     0.200000         8554         1.25
     274.175     0.300000        12356         1.43
     274.687     0.400000        16358         1.67
     275.199     0.500000        20004         2.00
     275.455     0.550000        21570         2.22
     275.711     0.600000        23033         2.50
     276.223     0.650000        25381         2.86
     276.735     0.700000        27161         3.33
     277.503     0.750000        28806         4.00
     278.015     0.775000        29468         4.44
     279.551     0.800000        30457         5.00
     283.903     0.825000        31369         5.71
     298.239     0.850000        32309         6.67
     306.687     0.875000        33276         8.00
     309.759     0.887500        33746         8.89
     312.319     0.900000        34210        10.00
     315.135     0.912500        34713        11.43
     319.743     0.925000        35164        13.33
     332.031     0.937500        35641        16.00
     336.639     0.943750        35869        17.78
     343.039     0.950000        36109        20.00
     351.743     0.956250        36342        22.86
     368.639     0.962500        36581        26.67
     388.351     0.968750        36818        32.00
     402.687     0.971875        36937        35.56
     419.583     0.975000        37057        40.00
     438.271     0.978125        37174        45.71
     458.751     0.981250        37292        53.33
     479.743     0.984375        37413        64.00
     487.423     0.985938        37473        71.11
     495.871     0.987500        37531        80.00
     505.343     0.989062        37589        91.43
     513.791     0.990625        37649       106.67
     520.959     0.992188        37708       128.00
     524.799     0.992969        37739       142.22
     528.895     0.993750        37768       160.00
     532.991     0.994531        37797       182.86
     537.087     0.995313        37826       213.33
     540.671     0.996094        37857       256.00
     543.231     0.996484        37872       284.44
     545.279     0.996875        37889       320.00
     547.327     0.997266        37902       365.71
     553.983     0.997656        37915       426.67
     564.223     0.998047        37930       512.00
     569.855     0.998242        37938       568.89
     576.511     0.998437        37946       640.00
     582.655     0.998633        37953       731.43
     592.895     0.998828        37960       853.33
     604.671     0.999023        37967      1024.00
     610.303     0.999121        37971      1137.78
     622.079     0.999219        37975      1280.00
     628.735     0.999316        37979      1462.86
     635.903     0.999414        37982      1706.67
     647.167     0.999512        37986      2048.00
     665.599     0.999561        37988      2275.56
     672.255     0.999609        37990      2560.00
     685.567     0.999658        37992      2925.71
     695.295     0.999707        37993      3413.33
     713.727     0.999756        37995      4096.00
     715.263     0.999780        37996      4551.11
     724.479     0.999805        37997      5120.00
     727.551     0.999829        37998      5851.43
     732.159     0.999854        37999      6826.67
     742.399     0.999878        38000      8192.00
     742.399     0.999890        38000      9102.22
     770.559     0.999902        38001     10240.00
     770.559     0.999915        38001     11702.86
     801.791     0.999927        38002     13653.33
     801.791     0.999939        38002     16384.00
     801.791     0.999945        38002     18204.44
     803.327     0.999951        38003     20480.00
     803.327     0.999957        38003     23405.71
     803.327     0.999963        38003     27306.67
     803.327     0.999969        38003     32768.00
     803.327     0.999973        38003     36408.89
     829.951     0.999976        38004     40960.00
     829.951     1.000000        38004          inf
#[Mean    =      287.224, StdDeviation   =       40.097]
#[Max     =      829.440, Total count    =        38004]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  38175 requests in 40.01m, 10.92MB read
  Socket errors: connect 0, read 0, write 0, timeout 82618
Requests/sec:     15.90  
Transfer/sec:      4.66KB
Running 40m test @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose
  8 threads and 100 connections

  Thread calibration: mean lat.: 337.034ms, rate sampling interval: 817ms
  Thread calibration: mean lat.: 360.918ms, rate sampling interval: 1021ms
  Thread calibration: mean lat.: 487.978ms, rate sampling interval: 1685ms
  Thread calibration: mean lat.: 384.586ms, rate sampling interval: 1108ms
  Thread calibration: mean lat.: 429.456ms, rate sampling interval: 1128ms
  Thread calibration: mean lat.: 363.214ms, rate sampling interval: 776ms
  Thread calibration: mean lat.: 1222.588ms, rate sampling interval: 6447ms
  Thread calibration: mean lat.: 345.962ms, rate sampling interval: 740ms

-----------------------------------------------------------------------
Test Results @ http://nginx-thrift.social-network3.svc.cluster.local:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency   355.95ms   61.72ms 647.17ms   93.56%
    Req/Sec     1.49      1.35     6.00     91.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%  340.99ms
 75.000%  344.83ms
 90.000%  391.68ms
 99.000%  647.17ms
 99.900%  869.38ms
 99.990%    1.64s 
 99.999%    1.95s 
100.000%    1.95s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

     126.207     0.000000            1         1.00
     329.471     0.100000         4127         1.11
     330.751     0.200000         8309         1.25
     332.287     0.300000        11761         1.43
     339.455     0.400000        15379         1.67
     340.991     0.500000        19157         2.00
     341.503     0.550000        21002         2.22
     342.015     0.600000        22856         2.50
     342.783     0.650000        25257         2.86
     343.551     0.700000        27105         3.33
     344.831     0.750000        28713         4.00
     346.367     0.775000        29505         4.44
     352.511     0.800000        30407         5.00
     364.031     0.825000        31374         5.71
     371.967     0.850000        32315         6.67
     378.879     0.875000        33264         8.00
     384.511     0.887500        33740         8.89
     391.679     0.900000        34205        10.00
     400.127     0.912500        34680        11.43
     408.831     0.925000        35166        13.33
     420.863     0.937500        35631        16.00
     430.335     0.943750        35870        17.78
     443.391     0.950000        36106        20.00
     460.543     0.956250        36343        22.86
     486.399     0.962500        36581        26.67
     521.983     0.968750        36818        32.00
     540.159     0.971875        36939        35.56
     561.151     0.975000        37055        40.00
     579.071     0.978125        37174        45.71
     598.527     0.981250        37294        53.33
     618.495     0.984375        37412        64.00
     627.199     0.985938        37471        71.11
     634.879     0.987500        37531        80.00
     642.047     0.989062        37594        91.43
     650.751     0.990625        37653       106.67
     658.431     0.992188        37710       128.00
     664.063     0.992969        37740       142.22
     669.695     0.993750        37769       160.00
     675.839     0.994531        37798       182.86
     684.031     0.995313        37828       213.33
     696.319     0.996094        37857       256.00
     700.415     0.996484        37872       284.44
     710.655     0.996875        37888       320.00
     720.383     0.997266        37902       365.71
     750.591     0.997656        37917       426.67
     768.511     0.998047        37932       512.00
     781.311     0.998242        37939       568.89
     798.719     0.998437        37946       640.00
     823.807     0.998633        37954       731.43
     844.799     0.998828        37961       853.33
     888.319     0.999023        37968      1024.00
     908.287     0.999121        37972      1137.78
     953.343     0.999219        37976      1280.00
    1009.151     0.999316        37980      1462.86
    1063.935     0.999414        37983      1706.67
    1128.447     0.999512        37987      2048.00
    1134.591     0.999561        37989      2275.56
    1190.911     0.999609        37991      2560.00
    1371.135     0.999658        37993      2925.71
    1386.495     0.999707        37994      3413.33
    1403.903     0.999756        37996      4096.00
    1446.911     0.999780        37997      4551.11
    1475.583     0.999805        37998      5120.00
    1523.711     0.999829        37999      5851.43
    1537.023     0.999854        38000      6826.67
    1637.375     0.999878        38001      8192.00
    1637.375     0.999890        38001      9102.22
    1641.471     0.999902        38002     10240.00
    1641.471     0.999915        38002     11702.86
    1699.839     0.999927        38003     13653.33
    1699.839     0.999939        38003     16384.00
    1699.839     0.999945        38003     18204.44
    1728.511     0.999951        38004     20480.00
    1728.511     0.999957        38004     23405.71
    1728.511     0.999963        38004     27306.67
    1728.511     0.999969        38004     32768.00
    1728.511     0.999973        38004     36408.89
    1947.647     0.999976        38005     40960.00
    1947.647     1.000000        38005          inf
#[Mean    =      355.955, StdDeviation   =       61.720]
#[Max     =     1946.624, Total count    =        38005]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  38176 requests in 40.01m, 10.96MB read
  Socket errors: connect 0, read 0, write 0, timeout 82590
  Non-2xx or 3xx responses: 15
Requests/sec:     15.90  
Transfer/sec:      4.68KB